Public Member Functions | Friends | List of all members
IFCAPI::HookAssignments Class Referencefinal
IFC Data Access
Class to set up an assignment structure for the assignments export hook. More...
#include <IFCHookAssignments.hpp>
 Inheritance diagram for IFCAPI::HookAssignments:
 Public Member Functions
ACAPI::Result< IFCAPI::ObjectID >  | CreateIfcGroup (const API_Guid &guid, const IFCType &ifcType, const std::optional< GS::UniString > &name, bool addAsRoot)
Add an IFC Group definition to the assignment hook structure.
ACAPI::Result< IFCAPI::ObjectID >  | GetIfcRelAssignsToGroup (const IFCAPI::ObjectID groupObjectID) const
Get the IFC RelAssignsToGroup object of the passed group object.
ACAPI::Result< IFCAPI::ObjectID >  | GetIfcRelServicesBuildings (const IFCAPI::ObjectID systemObjectID) const
Get the IFC RelServicesBuildings object of the passed system object.
ACAPI::Result< void >  | AssignObjects (const IFCAPI::ObjectID groupID, const std::vector< IFCAPI::ObjectID > &assignedObjectIDs)
Assign objects to the passed group object.
ACAPI::Result< void >  | ServiceBuildings (const IFCAPI::ObjectID systemID, const std::vector< IFCAPI::ObjectID > &servicedObjectIDs)
Set serviced spatial element objects to the passed system object.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | HookDataProvider
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
Class to set up an assignment structure for the assignments export hook.
Since
Archicad 28
Remarks
See IFCHook_Test.cpp for a complete example.